In [1]:
a=10
b=20
c=a+b
c

30

In [1]:
================== Data Analysis ===============================
1.  Pandas               : Data frame analysis
2.  Numpy                : Numerical analysis
3.  Matplotlib           : Graphs and plots
4.  Seaborn              : Plots
5.  Bokeh                : Plots
6.  Plotly               : Plots

================== Machine Learning ============================
7.  Stats                         : Statistical models
8.  Scikit-learn(sk-learn)        : ML models

================== Deep Learning ===============================
9.  OpenCV               : Computer vision
10. Pillow               : Image operations
11. TensorFlow           : Neural network creation (Google)
12. Keras                : Neural networks(NN)
13. PyTorch              : Alternative package to TensorFlow (Meta/Facebook)

====================== NLP =======================================
14. NLTK                 : Natural language toolkit
15. SpaCy                : Alternative to NLTK
16. WordCloud            : Most frequent words

==================== Scraping =======================================
17. SQLite               : Database creation
18. Beautiful Soup       : # Web scraping
19. Selenium             : # Web automation

================== API Creation ====================================
20. Flask                : # Web framework
21. FastAPI              : # Web framework
22. Gradio               : # API/UI creation
23. Django               : # Web framework

================== UI App Creation ================================
24. Streamlit            : UI/Apps for ML/DL

========== Transfer Learning Models (DL) ===========================
25. MobileNet            : # CNN model
26. ResNet               : # CNN model
27. VGGNet               : # CNN model
28. Inception            : # CNN model
29. YOLO                 : # Object detection (Ultralytics)

========== Transfer Learning Models (NLP) ===========================
30. Word2Vec             : # Word embeddings
31. GloVe                : # Word embeddings

=============== Hugging Face Transformers ===========================
32. BERT                 : Bi-directional Encoder Representations of 
                           Treansformers
==================== Allen NLP =====================================
33. AllenNLP             : NLP packages

====================== GenAI ===========================================
34. LangChain                                : # LLM orchestration
35. Google Gemini AI releated packages       : # Google’s GenAI models
36. OpenAI GPT releated packages             : # OpenAI’s LLMs
37. Amazon Bedrock related package           : # AWS GenAI platform
38. Meta LLaMA related packages              : # Meta’s LLM family
==================== Image and Video Generations ====================
39. GAN models realted packages
40. SORA related packages
==================== Model deployment (MLOps) ====================
41. mlflow using databricks
42. kubeflow (GCP account)

==================== Cloud applications ============================
43. Azure ML realted packages
44. GCP VertexAI related packages
45. AWS Sagemaker realted packages

==================== small ==========================================
46. time
47. logging
48. math
49. random
50. env
51. os

SyntaxError: invalid character '’' (U+2019) (3552102254.py, line 58)

**Step-1; Import Packages**

In [2]:
# so here we need to import 4 packages

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt   # Note: Here (lib) means libirary and (pyplot) means python plot 
import seaborn as sns

# so here whenever we have to use the package (numpy,pandas,matplotlib,seaborn),we can use np,pd,plt,sns instead
# so, np means we are using numpy package as a np , and pd mean we are using pandas package as a pd

In [ ]:
# A row consists of people, things, or information placed in a straight line, side by side.
# A column consists of elements arranged one on top of the other. In other words,
# the difference between a row and a column is that a row is horizontal, whereas a column is vertical

**Step-2: Create a Dataframe using list**

In [ ]:
# So if we do shift+tab on pd.DataFrame(names)
# then we will see three arguments

# 1. data: so we can provide our data either list format or dict format

# 2. index: we need to provide a list

# 3. colums: we need to provide a list

In [37]:
# so here we will take one column
names=['Ramesh','Suresh','Satish']
pd.DataFrame(names)
# do shift + tab

# so here we create a column using DataFrame method,
# now onwards whenever we have to create a column 
# we shall use DataFrame 
# and DataFrame is a method of pandas We already know this 
# and how we know?
# => beacuse we use pandas as pd

        0
0  Ramesh
1  Suresh
2  Satish

In [38]:
names=['Ramesh','Suresh','Satish']
pd.DataFrame(names,'Names')
# pd.DataFrame(names,index,columns)


# so when we run this code this code will show error,
# beacuse pd.DataFrame(data,index,columns)
# here first we have to provide the data the we need to provide the index otherwise it will show error 
# and then we need to provide columns otherwise it will also show error
# so if we want to provide columns do like this
# names=['Ramesh','Suresh','Satish']
# pd.DataFrame(names,colums='Names')
# and names='Ramesh','Suresh','Satish'===> ye likhane ki jarurat nahi hai beacuse by default names first no par hi aata hai
# and if we run this error will come

TypeError: Index(...) must be called with a collection of some kind, 'Names' was passed

In [39]:
# so this error signifies that you have to retuen this column in list that we already seen
# thats why do like this then error will not come

names=['Ramesh','Suresh','Satish']
pd.DataFrame(names,columns=['Names'])
# pd.DataFrame(names,index,columns)

    Names
0  Ramesh
1  Suresh
2  Satish

In [40]:
names=['Ramesh','Suresh','Satish']
pd.DataFrame(names,
             columns=['Names'])
# pd.DataFrame(names,index,columns)

    Names
0  Ramesh
1  Suresh
2  Satish

**Step-3: Change the Index**

In [41]:
names=['Ramesh','Suresh','Satish']
idx=['A','B','C']
pd.DataFrame(names,
             index=['A','B','C'],
             columns=['Names'])

    Names
A  Ramesh
B  Suresh
C  Satish

In [42]:
names=['Ramesh','Suresh','Satish']
idx=['A','B','C']
pd.DataFrame(names,index=['A','B','C'],columns=['Names'])

    Names
A  Ramesh
B  Suresh
C  Satish

In [43]:
names=['Ramesh','Suresh','Satish']
pd.DataFrame(names,
             index=['A','B','C'],
             columns=['Names'])

    Names
A  Ramesh
B  Suresh
C  Satish

In [19]:
# but if we do like this then it will show error
names=['Ramesh','Suresh','Satish']
pd.DataFrame(names,
             index=['A','B',],
             columns=['Names'])

ValueError: Shape of passed values is (3, 1), indices imply (2, 1)

In [ ]:
# this error signifies you have passes one columns ['Ramesh','Suresh','Satish']
# but you don't have passes three index ['A','B']
# that's why we have to provide all three indexes=['A','B','C']
# indexs is nothing but rows

In [44]:
names=['Ramesh','Suresh','Satish']
idx=['A','B','C']
cols=['Names']
pd.DataFrame(names,
             index=idx,
             columns=cols)

# this method also we can write by providing variable

    Names
A  Ramesh
B  Suresh
C  Satish

**Step-4: add multiple columns**

In [ ]:
# names=['Ramesh','Suresh','Satish']
# age=[20,22,24]
# pd.DataFrame()
# so here I want to take two column data then how can I can  access this data 
# => by using 'zip'

In [45]:
# do like this for access two column at a time

names=['Ramesh','Suresh','Satish']
age=[20,22,24]
pd.DataFrame(zip(names,age),
            columns=['Names','Age'])

# The zip() function in Python is a neat tool that allows you to combine multiple lists 
# or other iterables (like tuples, sets, or even strings) into one iterable of tuples.
# Think of it like a zipper on a jacket that brings two sides together.

    Names  Age
0  Ramesh   20
1  Suresh   22
2  Satish   24

**Step-5: Create Empty dataframe and update the columns**

In [46]:
pd.DataFrame()
# this is empty dataframe
# so give an variable to this method for eg(df)

Empty DataFrame
Columns: []
Index: []

In [47]:
df=pd.DataFrame()
df['Names']=['Ramesh','Suresh','Satish']
df

    Names
0  Ramesh
1  Suresh
2  Satish

In [48]:
df=pd.DataFrame()
df['Names']=['Ramesh','Suresh','Satish']
df['Age']=[20,22,23]
df

# we are taking empty first and simultaneously 
# we are updating the empty data 
# and for updation we use an variable(df)
# so just by giving one variable(df),
# we can use pd.DataFrame() multiple times for multiple columns

    Names  Age
0  Ramesh   20
1  Suresh   22
2  Satish   23

**Step-6: Add a new colum with existing dataframe**

In [49]:
names=['Ramesh','Suresh','Satish']
age=[20,22,24]
df=pd.DataFrame(zip(names,age),
            columns=['Names','Age'])
df
# so assume this dataframe is already existed, and i want to add {city=['hyd','mumbai','chennai']} an new column

    Names  Age
0  Ramesh   20
1  Suresh   22
2  Satish   24

In [50]:
names=['Ramesh','Suresh','Satish']
age=[20,22,24]
df=pd.DataFrame(zip(names,age,),
            columns=['Names','Age'])
df['City']=['hyd','pune','blr']
df

    Names  Age  City
0  Ramesh   20   hyd
1  Suresh   22  pune
2  Satish   24   blr

In [51]:
# or

names=['Ramesh','Suresh','Satish']
age=[20,22,24]
city=['hyd','pune','blr']
df=pd.DataFrame(zip(names,age,city),
            columns=['Names','Age','City'])
df

    Names  Age  City
0  Ramesh   20   hyd
1  Suresh   22  pune
2  Satish   24   blr

**Step-7: Overwrite the column values**


- suppose I want to overwrit my age

-  originally my age is = [20,22,24]

-  now i want to update the age = [30,32,34]

In [20]:
df # this is our existing dataframe and update their age column

    Names  Age  City
0  Ramesh   20   hyd
1  Suresh   22  pune
2  Satish   24   blr

In [52]:
df['Age']=[30,32,34]      # this is how we updated age column

In [53]:
df

    Names  Age  City
0  Ramesh   30   hyd
1  Suresh   32  pune
2  Satish   34   blr

In [ ]:
# suppose, by mistaken if we given small 'a' instead of capital 'A'
# then new column will appear

In [54]:
df

    Names  Age  City
0  Ramesh   30   hyd
1  Suresh   32  pune
2  Satish   34   blr

**Step-8: drop the column**

- labels

- axis

- index

- columns

- inplace

In [55]:
df['Age']=[30,32,34] 
df['age']=[30,32,34] 
df

    Names  Age  City  age
0  Ramesh   30   hyd   30
1  Suresh   32  pune   32
2  Satish   34   blr   34

In [56]:
df

    Names  Age  City  age
0  Ramesh   30   hyd   30
1  Suresh   32  pune   32
2  Satish   34   blr   34

In [34]:
df.drop('age')    
# label = either 0 or Names
# index= 0  1  2
# column = Names  Age  City  age
# here python will assume age is a label
# and python will ask qn to himself: is it index label or column label
# for that we need to provide axis 
# axis= 1 means for cloumn
# axis= 0 means for rows
# by default python will take axis=0 
# it means python ('age') ko index samjhega,instead of column
# beacuse when we do shift+tab then, axis: 'Axis' = 0
# beacuse python will assume age is a index label and
# but actually me age is column
# so if we run this it will give error

KeyError: "['age'] not found in axis"

In [35]:
  df.drop('age',axis=0)   
# this is also error
# beacuse axis = 0 means index label
# so to avoid this error use axis=1 
# and we already know that axis=1 is used for column label

KeyError: "['age'] not found in axis"

In [57]:
# thats why you will have to right like this
df.drop('age',
        axis=1)
# now the column of age will override

    Names  Age  City
0  Ramesh   30   hyd
1  Suresh   32  pune
2  Satish   34   blr

In [58]:
df   # so here age [30,32,34] colum will override 
     # but we are able to see old column still
     # beacuse we did not apply inplace=true

    Names  Age  City  age
0  Ramesh   30   hyd   30
1  Suresh   32  pune   32
2  Satish   34   blr   34

In [59]:
df.drop('age',
        axis=1,
       inplace=True)
# inplace will help you to override the age column

In [39]:
df

    Names  Age  City
0  Ramesh   30   hyd
1  Suresh   32  pune
2  Satish   34   blr

In [60]:
df.drop(columns=['age'],
       inplace=True)   
# inplace will help you to override the age column

KeyError: "['age'] not found in axis"

In [61]:
df

    Names  Age  City
0  Ramesh   30   hyd
1  Suresh   32  pune
2  Satish   34   blr

In [33]:
# drop index=2 
df.drop(2,
       axis=0)

    Names  Age  City
0  Ramesh   30   hyd
1  Suresh   32  pune

In [62]:
# or
df.drop(index=2)

    Names  Age  City
0  Ramesh   30   hyd
1  Suresh   32  pune

**Step-9: rename the columns**

In [63]:
df
# I want to change Capital city column with small city column

    Names  Age  City
0  Ramesh   30   hyd
1  Suresh   32  pune
2  Satish   34   blr

In [ ]:
df.rename()
# do shift + tab
df.rename(
    mapper: 'Renamer | None' = None,
    *,
    index: 'Renamer | None' = None,
    columns: 'Renamer | None' = None,
    axis: 'Axis | None' = None,
    copy: 'bool | None' = None,
    inplace: 'bool' = False,
    level: 'Level | None' = None,
    errors: 'IgnoreRaise' = 'ignore',
) -> 'DataFrame | None'

In [ ]:
# so here 
# mapper: mapper is nothing but dictionary
# index:
# columns:
# axis:
# copy:
# inplace:

In [45]:
df.rename('City','city')
# python will ask qn itself that 'City' is column or index?
# and agar hume python ko batana hai ki vo index hai ya column hai
# hume definately axis lgega
# and agar hume axis nahi lena hai to
# hume specifically columns= or index= mention karna hoga 
# here City is a column

TypeError: DataFrame.rename() takes from 1 to 2 positional arguments but 3 were given

In [64]:
dict1={'City':'city'}
df.rename(dict1)

    Names  Age  City
0  Ramesh   30   hyd
1  Suresh   32  pune
2  Satish   34   blr

In [ ]:
# so here capital City doesn't change into small city
# so do something like this

In [66]:
dict1={'City':'city'}
df.rename(columns=dict1)

    Names  Age  city
0  Ramesh   30   hyd
1  Suresh   32  pune
2  Satish   34   blr

In [67]:
dict1={'City':'city'}
df.rename(dict1,axis=1)

    Names  Age  city
0  Ramesh   30   hyd
1  Suresh   32  pune
2  Satish   34   blr

In [ ]:
# Sir what is label?
# index = 0,1,2
# columns = Names, Age, City
# label = either name or 0

In [49]:
# Can we change 2 to 'B'

dict1={2:'B'}
df.rename(dict1,axis=0)

    Names  Age  City
0  Ramesh   30   hyd
1  Suresh   32  pune
B  Satish   34   blr

In [69]:
# Or
dict1={2:'B'}
df.rename(index=dict1)

    Names  Age  City
0  Ramesh   30   hyd
1  Suresh   32  pune
B  Satish   34   blr

In [3]:
df1=pd.DataFrame()
df1['value']=[i for i in range(1,10)]
df1['square_value']=[i**2 for i in range(1,10)]
df1['cube_value']=[i**3 for i in range(1,10)]
df1

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16          64
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

In [ ]:
- len

- columns

- shape                 # These are some quick checks 

- dtype

- head

- tail

In [ ]:
# so do like this

# df1.columns
# df1.shape
# df1.dtypes
# df1.head
# df1.tail

In [52]:
df1.columns

Index(['value', 'square_value', 'cube_value'], dtype='object')

In [53]:
# so this index 
# if we want to convert into list do like this
list(df1.columns)

['value', 'square_value', 'cube_value']

In [54]:
# Or
df1.columns.to_list()

['value', 'square_value', 'cube_value']

In [55]:
df1.shape
# so here df1.shape ka matlab hai ki 9 rows and 3 columns

(9, 3)

In [56]:
df1.dtypes
# for integer we will get int
# for float we will get float
# foe string we will get object

value           int64
square_value    int64
cube_value      int64
dtype: object

In [57]:
df1.head()
# so here if we don't mention any value in the brackets 
# then first five rows will come

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16          64
4      5            25         125

In [58]:
df1.head(2)
# here we have mentioned that we want first two rows 
# that's why it printed only first two rows

   value  square_value  cube_value
0      1             1           1
1      2             4           8

In [59]:
df1.tail()
# here it is printing last 5 rows
# if we provide how many rows we want then it will provide only that much rows

   value  square_value  cube_value
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

In [60]:
df1.tail(3)

   value  square_value  cube_value
6      7            49         343
7      8            64         512
8      9            81         729

In [61]:
len(df1)
# it means there are 9 rows

9

In [72]:
df1.isnull()
# so here isnull means we are asking a quesion?
# that null value is avaliable or not
# True means yes null value is avaliable
# False means no null value is not avaliable

   value  square_value  cube_value
0  False         False       False
1  False         False       False
2  False         False       False
3  False         False       False
4  False         False       False
5  False         False       False
6  False         False       False
7  False         False       False
8  False         False       False

In [63]:
df1.isnull().sum()
# column wise null value will display

value           0
square_value    0
cube_value      0
dtype: int64

###### df1.info()
# here complete information will come about df1

**step-10  how to change specific value of columns**

- Till now we have seen drop,rename but if we want to change specific value of columns use replace

- df1.drop
    - it either will drop columns or index

- df1.rename
    - it will rename the columns or index

- df1.replace
    - how we can replace below data and what it will replace

In [ ]:
  value  	square_value	  cube_value
0	1	          1                1
1	2	          4	               8
2	3	          9 	           27
3	4	          16	           64    
4	5	          25	          125
5	6	          36	          216
6	7	          49	          343
7	8	          64	          512
8	9	          81	          729


# So here replace 64 from the cube_value to 464
# how can we do it
# here we want to do individual 64

In [65]:
df1.replace(64,464)

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16         464
4      5            25         125
5      6            36         216
6      7            49         343
7      8           464         512
8      9            81         729

In [ ]:
# yaha par humane 64 ko replace to kar diya 
# but jaha jaha par bhi 64 avaliable tha 
# uss sanbhi jagha par se 64 replace ho gaya 
# and hume sirf cube_value ke 64 ko replace karna tha

In [66]:
# lets see how we can do that
df1.replace({64:464,1:111}) # here also all the data will replace

   value  square_value  cube_value
0    111           111         111
1      2             4           8
2      3             9          27
3      4            16         464
4      5            25         125
5      6            36         216
6      7            49         343
7      8           464         512
8      9            81         729

In [ ]:
# in order to to avoid the data we have to mention that 
# lets see how we can mention
# and this is our step-11

**Step-11: Selection of a column**

In [67]:
df1['cube_value']   # this is how we can select particular column
# what is this type
# => so this is sreies 
# series looks like dataframe
# but no rows and no column

0      1
1      8
2     27
3     64
4    125
5    216
6    343
7    512
8    729
Name: cube_value, dtype: int64

In [68]:
type(df1)

pandas.core.frame.DataFrame

In [ ]:
# pandas.core.frame.DataFrame
# so this is the dataframe
# but if we apply specific column 
# then that becomes series
# just like this

In [69]:
type(df1['cube_value'])

pandas.core.series.Series

In [ ]:
# pandas.core.series.Series
# so this became series
# and series is always a one dimensional data

In [ ]:
Note: there is a huge difference in betweem serires and column
      we will see it later
      and series is always a one dimenational

In [70]:
# for ex. if we apply df1.shape it will show two dimensional 
# but if we apply df1['cube_values'] it will show ome dimensional
df1.shape

(9, 3)

In [ ]:
# so here df1 is not a series its a dataframe 
# that's why it shows two dimensional data
# but cube_value is particular column from the df1 dataframe
# then it becomes series
# and that's why it will show one dimenional data

In [71]:
df1['cube_value'].shape

(9,)

In [ ]:
# (9, 3)       this is two dimension data
# (9,)         this is one dimension data

In [ ]:
# if i want to make it two dimensional 
# then i need to use two columns
# just like this

In [72]:
df1[['cube_value']]

   cube_value
0           1
1           8
2          27
3          64
4         125
5         216
6         343
7         512
8         729

In [4]:
# so this is look like dataframe
# pahale wala dataframe ki tarah nahi lag raha tha 
# and now if we apply shape of this then it will become dataframe
df1[['cube_value']].shape

(9, 1)

In [5]:
type(df1[['cube_value']])

pandas.core.frame.DataFrame

In [ ]:
# now it will show two dimemsional

In [ ]:
# if we want to select multiple columns together
# then how can we write that 
# for eg. we want square_value & cube_value together
# then how can we select

In [6]:
# if we do like this it will show error
df1['square_value','cube_value']
# always remember whenever we want multiple things, keep those into list
# df1['square_value','cube_value']==>this is not a list this is accessing values 
# df1[['square_value','cube_value']]==> this is list

KeyError: ('square_value', 'cube_value')

In [74]:
df1[['square_value','cube_value']]
# here we are accessing multiple column together
# and that's put them into list

   square_value  cube_value
0             1           1
1             4           8
2             9          27
3            16          64
4            25         125
5            36         216
6            49         343
7            64         512
8            81         729

In [ ]:
# df1[['square_value','cube_value']]
# so here why we provided two square brackets?
# => beacuse inner square is used to access the data of square_value,cube_value
# but outside square brackets is a list6

In [75]:
# now let's replace the value
df1['cube_value'].replace(64,464)

0      1
1      8
2     27
3    464
4    125
5    216
6    343
7    512
8    729
Name: cube_value, dtype: int64

In [76]:
df1['cube_value'].replace(64,464,inplace=True)

In [77]:
df1

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16         464
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

In [ ]:
# here we take inplace=True to save 464 im original dataset

**Step-12: how to append(add) a row**

In append there is loc & iloc function

- loc

- iloc

In [ ]:
# df1.loc[rows,colums]
# here the left side of comma is specifically for rows & right side are specifically for colums
# we can select a particular row and column via using a list
# and we already know how to do that
# list: [start:stop:step]

In [78]:
# for eg.

df1.loc[[3:7],[1:3]]
# so here are 4 rows avaliable from 3 to 7
# and 3 columns from 1 to 3 
# now if we run this it will show error 
# it means loc function is not accepting this kind of list representation

SyntaxError: invalid syntax (2817841081.py, line 3)

In [77]:
# So do like this
df1.loc[[3:7]]
# it will also show error beacuse it is not taking inside list

SyntaxError: invalid syntax (3997143591.py, line 2)

In [4]:
# so do like this it will not show error
df1.loc[3:7]
# but it is only showing rows representation 
# so if I want to see column representation use iloc function (df1.iloc[3:7,1:3]) or (df1.loc[3:7,['square_value','cube_value']])

   value  square_value  cube_value
3      4            16          64
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512

In [78]:
# Do like this 
df1.loc[[3,7]]

   value  square_value  cube_value
3      4            16          64
7      8            64         512

In [82]:
# now

df1.iloc[3:7,1:3]
# so in 'loc' columns number will not work
# but in 'iloc' it will work

   square_value  cube_value
3            16         464
4            25         125
5            36         216
6            49         343

In [83]:
# Note: If we want to run column number in loc function do like below example
df1.loc[3:7,['square_value','cube_value']]

   square_value  cube_value
3            16         464
4            25         125
5            36         216
6            49         343
7            64         512

In [84]:
# Or
cols=['square_value','cube_value']
df1.loc[3:7,cols]

   square_value  cube_value
3            16         464
4            25         125
5            36         216
6            49         343
7            64         512

In [ ]:
# In 'loc' we are providing names(str)
# In the 'iloc' we are providing numbers

In [ ]:
# let's do drill

df1.iloc[[2,3,4]]
df1.iloc[[2]]
df1.iloc[2]
df1.iloc[[2,3,4],[0,2]]
df1.iloc[2,0]
df1.iloc[:,0]
df1.iloc[2,:]
df1.iloc[[2],:]
df1.iloc[2:6,0]
df1.iloc[2:6,[0]]

In [85]:
df1.iloc[[2,3,4]]       #2d
# selecting 3 rows, all the columns
# it's a dataframe

   value  square_value  cube_value
2      3             9          27
3      4            16         464
4      5            25         125

In [5]:
df1.iloc[[2,4]]

   value  square_value  cube_value
2      3             9          27
4      5            25         125

In [86]:
df1.iloc[[2]]       # 2d

   value  square_value  cube_value
2      3             9          27

In [87]:
df1.iloc[2]      # 1d 
# it's a series

value            3
square_value     9
cube_value      27
Name: 2, dtype: int64

In [ ]:
# to identify which is series and which is dataframe
# identify how many square brackets are there
# if two square brackets are present then it is dataframe(2d)
# if one square brackets are present then it is series(1d)
# if three square brackets are present then it is dataframe(3d)

In [88]:
df1.iloc[[2,3,4],[0,2]]    #2d
# 2,3,4 row
# 0 and 2nd index (1,3)

   value  cube_value
2      3          27
3      4         464
4      5         125

In [89]:
df1.iloc[2,0]         # 1d

np.int64(3)

In [90]:
df1
# In column1(value) i want to replace value to 60
# based on specific index

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16         464
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

In [91]:
df1
df1.iloc[5,0]

np.int64(6)

In [92]:
df1.iloc[:,0]         # 1d

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
Name: value, dtype: int64

In [93]:
df1.iloc[2,:]     # 1d

value            3
square_value     9
cube_value      27
Name: 2, dtype: int64

In [94]:
df1.iloc[[2],:]   # 2d

   value  square_value  cube_value
2      3             9          27

In [95]:
df1.iloc[2:6,0]

2    3
3    4
4    5
5    6
Name: value, dtype: int64

In [96]:
df1.iloc[2:6,[0]]

   value
2      3
3      4
4      5
5      6

**now let's see how to append a row**

- append is nothing but the adding

In [97]:
df1

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16         464
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

In [ ]:
# here i want to append a row at 9
# lets see how we can do it

In [7]:
df1.loc[9]=[10,100,1000]
df1

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16          64
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729
9     10           100        1000

In [8]:
# or
ID=len(df1)
df1.loc[ID]=[10,100,1000]
df1

    value  square_value  cube_value
0       1             1           1
1       2             4           8
2       3             9          27
3       4            16          64
4       5            25         125
5       6            36         216
6       7            49         343
7       8            64         512
8       9            81         729
9      10           100        1000
10     10           100        1000

**Step-13: Save the DataFrames**

- we can save dataframes in two ways

-  .csv

- .xlsx

**we need three things**

- where I want to save: directory

- what I want to save: filename

- what is type of a file: extension

In [ ]:
- different folder: r"C:\Users\LENOVO\Documents\Naresh IT\EDA\data1.csv"

- different folder: r"C:\Users\LENOVO\Documents\Naresh IT\EDA\data1.xlsv" 

- same folder: r"data1.csv"    or    r"data1.xlsv"

In [100]:
csv_path=r"C:\Users\LENOVO\Documents\Naresh IT\Gen AI\data.csv"
excel_path=r"C:\Users\LENOVO\Documents\Naresh IT\Gen AI\data.xlsx"
df1.to_csv(csv_path)
df1.to_excel(excel_path)

In [103]:
csv_path=r"data1.csv"
excel_path=r"data1.xlsx"
df1.to_csv(csv_path)          # index column created extra 
df1.to_excel(excel_path)      # index column created extra

In [ ]:
# so here one extra index will create automatically

**Step-14: read the data**

In [105]:
csv_path=r"data1.csv"
pd.read_csv(csv_path)

    Unnamed: 0  value  square_value  cube_value
0            0      1             1           1
1            1      2             4           8
2            2      3             9          27
3            3      4            16         464
4            4      5            25         125
5            5      6            36         216
6            6      7            49         343
7            7      8            64         512
8            8      9            81         729
9            9     10           100        1000
10          10     10           100        1000

In [ ]:
# here one extra index has arrived

In [106]:
excel_path=r"data1.xlsx"
pd.read_excel(excel_path)

    Unnamed: 0  value  square_value  cube_value
0            0      1             1           1
1            1      2             4           8
2            2      3             9          27
3            3      4            16         464
4            4      5            25         125
5            5      6            36         216
6            6      7            49         343
7            7      8            64         512
8            8      9            81         729
9            9     10           100        1000
10          10     10           100        1000

In [ ]:
# here also one extra index has arrived

In [108]:
csv_path=r"data1.csv"
excel_path=r"data1.xlsx"
df1.to_csv(csv_path,index=False)         
df1.to_excel(excel_path,index=False)

In [ ]:
# now if we use 'index=false' then we will not get the extra index